{
  "class_name": "Functional",
  "config": {
    "name": "model",
    "trainable": true,
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            100
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_1"
        },
        "name": "input_1",
        "inbound_nodes": []
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": "float32",
          "units": 256,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense",
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            1
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization",
        "inbound_nodes": [
          [
            [
              "dense",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_1",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_1",
        "inbound_nodes": [
          [
            [
              "batch_normalization",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 128,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_1",
        "inbound_nodes": [
          [
            [
              "dropout_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_1",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            1
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_1",
        "inbound_nodes": [
          [
            [
              "dense_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_2",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_2",
        "inbound_nodes": [
          [
            [
              "batch_normalization_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_2",
        "inbound_nodes": [
          [
            [
              "dropout_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_2",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            1
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_2",
        "inbound_nodes": [
          [
            [
              "dense_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_3",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_3",
        "inbound_nodes": [
          [
            [
              "batch_normalization_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_3",
          "trainable": true,
          "dtype": "float32",
          "units": 1,
          "activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_3",
        "inbound_nodes": [
          [
            [
              "dropout_3",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_1",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_3",
        0,
        0
      ]
    ]
  }
}