{
  "class_name": "Functional",
  "config": {
    "name": "FeatureTokenTransformer",
    "trainable": true,
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            100
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_6"
        },
        "name": "input_6",
        "inbound_nodes": []
      },
      {
        "class_name": "Reshape",
        "config": {
          "name": "reshape_5",
          "trainable": true,
          "dtype": "float32",
          "target_shape": [
            100,
            1
          ]
        },
        "name": "reshape_5",
        "inbound_nodes": [
          [
            [
              "input_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_30",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_30",
        "inbound_nodes": [
          [
            [
              "reshape_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MultiHeadAttention",
        "config": {
          "name": "multi_head_attention_5",
          "trainable": true,
          "dtype": "float32",
          "num_heads": 4,
          "key_dim": 16,
          "value_dim": 16,
          "dropout": 0.2,
          "use_bias": true,
          "output_shape": null,
          "attention_axes": [
            1
          ],
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "query_shape": [
            null,
            100,
            64
          ],
          "key_shape": [
            null,
            100,
            64
          ],
          "value_shape": [
            null,
            100,
            64
          ]
        },
        "name": "multi_head_attention_5",
        "inbound_nodes": [
          [
            [
              "dense_30",
              0,
              0,
              {
                "value": [
                  "dense_30",
                  0,
                  0
                ]
              }
            ]
          ]
        ]
      },
      {
        "class_name": "Add",
        "config": {
          "name": "add_10",
          "trainable": true,
          "dtype": "float32"
        },
        "name": "add_10",
        "inbound_nodes": [
          [
            [
              "dense_30",
              0,
              0,
              {}
            ],
            [
              "multi_head_attention_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LayerNormalization",
        "config": {
          "name": "layer_normalization_10",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            2
          ],
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "layer_normalization_10",
        "inbound_nodes": [
          [
            [
              "add_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_31",
          "trainable": true,
          "dtype": "float32",
          "units": 256,
          "activation": "gelu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_31",
        "inbound_nodes": [
          [
            [
              "layer_normalization_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_15",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.2,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_15",
        "inbound_nodes": [
          [
            [
              "dense_31",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_32",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_32",
        "inbound_nodes": [
          [
            [
              "dropout_15",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Add",
        "config": {
          "name": "add_11",
          "trainable": true,
          "dtype": "float32"
        },
        "name": "add_11",
        "inbound_nodes": [
          [
            [
              "layer_normalization_10",
              0,
              0,
              {}
            ],
            [
              "dense_32",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LayerNormalization",
        "config": {
          "name": "layer_normalization_11",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            2
          ],
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "layer_normalization_11",
        "inbound_nodes": [
          [
            [
              "add_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "GlobalAveragePooling1D",
        "config": {
          "name": "global_average_pooling1d_5",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last",
          "keepdims": false
        },
        "name": "global_average_pooling1d_5",
        "inbound_nodes": [
          [
            [
              "layer_normalization_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_33",
          "trainable": true,
          "dtype": "float32",
          "units": 256,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_33",
        "inbound_nodes": [
          [
            [
              "global_average_pooling1d_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_10",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            1
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_10",
        "inbound_nodes": [
          [
            [
              "dense_33",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_16",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.4,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_16",
        "inbound_nodes": [
          [
            [
              "batch_normalization_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_34",
          "trainable": true,
          "dtype": "float32",
          "units": 128,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_34",
        "inbound_nodes": [
          [
            [
              "dropout_16",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_11",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            1
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "gamma_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "moving_mean_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "moving_variance_initializer": {
            "module": "keras.initializers",
            "class_name": "Ones",
            "config": {},
            "registered_name": null
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_11",
        "inbound_nodes": [
          [
            [
              "dense_34",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_17",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_17",
        "inbound_nodes": [
          [
            [
              "batch_normalization_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_35",
          "trainable": true,
          "dtype": "float32",
          "units": 1,
          "activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_35",
        "inbound_nodes": [
          [
            [
              "dropout_17",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_6",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_35",
        0,
        0
      ]
    ]
  }
}